ref os sample project in Project structure generated
